tap "homebrew/bundle"
tap "nikitabobko/tap"

brew "eza"
brew "git"
brew "neofetch"
brew "powerlevel10k"
brew "stow"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "aerospace"
cask "aerospace@0.12.0"
cask "alacritty"
cask "docker"
cask "ferdium"
cask "font-meslo-lg-nerd-font"
cask "google-chrome"
cask "keka"
cask "ledger-live"
cask "logitune"
cask "obsidian"
cask "openvpn-connect"
cask "postman"
cask "spotify"
cask "utm"
cask "visual-studio-code"
cask "zoom"

vscode "bierner.markdown-mermaid"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "damirka.move-syntax"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "emeraldwalk.runonsave"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.vscode-github-actions"
vscode "irongeek.vscode-env"
vscode "istarwyh.writinghelper"
vscode "lzwme.lzwme-eye-care"
vscode "matangover.mypy"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.autopep8"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "mysten.move"
vscode "mysten.move-trace-debug"
vscode "nomicfoundation.hardhat-solidity"
vscode "pkief.material-icon-theme"
vscode "rust-lang.rust-analyzer"
vscode "shakram02.bash-beautify"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
