tap "homebrew/bundle"
tap "mediosz/tap"
tap "nikitabobko/tap"

brew "eza"
brew "git"
brew "neofetch"
brew "neovim"
brew "node"
brew "powerlevel10k"
brew "python@3.13"
brew "stow"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "aerospace"
cask "aerospace@0.12.0"
cask "arc"
cask "cursor"
cask "discord"
cask "docker"
cask "font-meslo-lg-nerd-font"
cask "google-chrome"
cask "karabiner-elements"
cask "keka"
cask "ledger-live"
cask "logitune"
cask "notion"
cask "postman"
cask "spotify"
cask "swipeaerospace"
cask "utm"
cask "visual-studio-code"
cask "whatsapp"
cask "zoom"

vscode "batisteo.vscode-django"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "damirka.move-syntax"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "emeraldwalk.runonsave"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "irongeek.vscode-env"
vscode "istarwyh.writinghelper"
vscode "kevinrose.vsc-python-indent"
vscode "lzwme.lzwme-eye-care"
vscode "matangover.mypy"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "mysten.move"
vscode "mysten.move-trace-debug"
vscode "njpwerner.autodocstring"
vscode "nomicfoundation.hardhat-solidity"
vscode "pkief.material-icon-theme"
vscode "rust-lang.rust-analyzer"
vscode "shakram02.bash-beautify"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "teticio.python-envy"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "wholroyd.jinja"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
